[
    {
        "title" : "What is computer?",
        "subtitle" : "Computer คือ เครื่องมือหรืออุปกรณ์อิเล็กทรอนิกส์ ที่มีความสามารถในการคำนวณอัตโนมัติตามคำสั่ง ส่วนที่ใช้ประมวลผลเรียกว่าหน่วยประมวลผล ชุดของคำสั่งที่ระบุขั้นตอนการคำนวณเรียกว่าโปรแกรมคอมพิวเตอร์ ผลลัพธ์ที่ได้ออกมานั้นอาจเป็นได้ทั้ง ตัวเลข ข้อความ รูปภาพ เสียง หรือ อื่นๆอีกมากมาย ลักษณะทางกายภาพของคอมพิวเตอร์นั้นมีหลากหลาย มีทั้งขนาดที่ใหญ่มากจนต้องใช้ห้องทั้งห้องในการบรรจุ และขนาดเล็กจนวางได้บนฝ่ามือ การจัดแบ่งประเภทของคอมพิวเตอร์สามารถจัดแบ่งได้ตามขนาดทางกายภาพเป็นสำคัญ ซึ่งมักจะแปลผันกับประสิทธิภาพความเร็วในการประมวลผล",
        "image_url" : "https://cdn.pixabay.com/photo/2015/06/24/16/36/home-820389_960_720.jpg",
        "detail" : "คอมพิวเตอร์ในยุคแรกๆเช่น ENIAC เวลาโปรแกรมต้องใช้วิธีการเปลี่ยนสายเชื่อมต่ออุปกรณ์ต่างๆ ซึ่งเป็นวิธีการที่ยุ่งยากมาก จึงเกิดแนวคิดว่าตัวโปรแกรมน่าจะจัดเก็บอยู่ในส่วนที่สามารถปรับเปลี่ยนแก้ไขได้ง่าย เป็นที่มาของแนวคิดที่ทำการจัดเก็บข้อมูลต่างๆรวมถึงโปรแกรมไว้ใน หน่วยความจำ หรือ memory ทำให้คอมพิวเตอร์จะได้รับคำสั่งโดยการอ่านคำสั่งจากหน่วยความจำ และการปรับเปลี่ยนโปรแกรมสามารถทำได้โดยการเปลี่ยนแปลงค่าภายในหน่วยความจำ"
    },

    {
        "title" : "What is Programming?",
        "subtitle" : "Programming คือ การเขียนหรือสร้างคำสั่งให้คอมพิวเตอร์ทำงานให้ได้ตามที่ต้องการ ด้วยภาษาที่คอมพิวเตอร์เข้าใจ (สามารถแปลได้) ในการเขียนโปรแกรมนี้ ผู้เขียนจะต้องเข้าใจถึงขั้นตอนการแก้ปัญหา วิธีการแก้ รวมทั้ง ศัพท์และไวยากรณ์ ตลอดจนกฎเกณฑ์ของภาษาที่เลือกใช้ ดู programming language ประกอบ programming language one    ใช้ตัวย่อว่า PL/1 (อ่านว่า พีแอล/วัน) เป็นภาษาระดับสูง (high level language) รุ่นเก่าอีกภาษาหนึ่ง ส่วนใหญ่ใช้กับคอมพิวเตอร์ขนาดใหญ่ หรือเมนเฟรม (mainframe)",
        "image_url" : "https://cdn.pixabay.com/photo/2016/11/19/14/00/code-1839406_960_720.jpg",
        "detail" : "การสร้างซอฟต์แวร์ สร้างชุดคำสั่งหรือกระบวนการที่ทำให้คอมพิวเตอร์ทำงานได้ตามต้องการ ซึ่งก็ใช้ทักษะ coding ด้วยครับ แต่ถือว่าความรับผิดชอบมากกว่านั้นเพราะต้องจบออกมาเป็นซอฟต์แวร์ด้วย"
    },

    {
        "title" : "What is Programmer?",
        "subtitle" : "Programming คือ นักเขียนโปรแกรมคอมพิวเตอร์ ที่สามารถที่จะพัฒนา สร้างและแก้ไขปัญหาและยังรวมไปถึงการวิเคราะห์ข้อมูลเพื่อปรับปรุงให้ดีขึ้นเพื่อที่จะได้โปรแกรมหรือว่า Application ที่จะใช้งานบนอุปกรณ์เทคโนโลยีในปัจจุบันนี้ซึ่งจะทำงานผ่านการเขียน Code ด้วยภาษาเฉพาะที่เรียกกันในวงการภาษาคอมพิวเตอร์ โดยอาชีพโปรแกรมเมอร์ (Programmer) เป็นอาชีพที่มีรายได้สูง ตลาดต้องการจำนวนมาก แต่ทางตรงกันข้าม การที่จะเป็นโปรแกรมเมอร์ (Programmer) ได้นั้น จะต้องมีความพยายามที่สูง ศึกษาและฝึกฝนทำจนชำนาญ ในอาชีพนี้ถ้าคุณเก่งและมีประสบการณ์มากพอ ทำงานเสร็จหนึ่งโปรเจคสามารถสร้างเงินหลักแสนได้เลยทีเดียว",
        "image_url" : "https://cdn.pixabay.com/photo/2021/08/04/13/06/software-developer-6521720_960_720.jpg",
        "detail" : "นักเขียนโปรแกรมสามารถหมายถึงผู้ที่เชี่ยวชาญในการโปรแกรมเฉพาะด้าน หรือผู้ที่สามารถเขียนรหัสซอฟต์แวร์ได้หลากหลายข้อมูล"
    }
]
